Repository: ezratawachi/savers
Catalog: swift/SAVERS/Resources/Localizable.xcstrings
Source language: en
Languages: es

source: "%@" goes like {"YYYY-MM-DD": {…}}.
es: "%@" va como {"AAAA-MM-DD": {…}}.

source: "%@" has to have "%@" or "%@".
es: "%1$@" tiene que tener "%2$@" o "%3$@".

source: "%@" has to say what each day is.
es: "%@" tiene que decir qué es cada día.

source: # My sunrise in Sunling Today is %@ (%@). Here's everything from Sunling, my app for starting the day, so you can help me.
es: # Mi amanecer en Sunling Hoy es %1$@ (%2$@). Te paso todo lo de Sunling, mi app para empezar el día, para que me ayudes.

source: ## Dates with changes (read only)
es: ## Fechas con cambios (solo para leer)

source: ## How it's gone (last %lld weeks, read only)
es: ## Cómo me ha ido (últimas %lld semanas, solo para leer)

source: ## How the app works - My sunrise is six short steps each morning, to start the day with myself before the world. It's always all six: when time is short, they get shorter, they don't get dropped. - Breathe: a few minutes still, to breathe, meditate or pray. - Affirm: out loud, a few phrases I believe about who I choose to be. Nothing over the top like "I'm amazing": for someone who doesn't believe it, it makes things worse. - Imagine: today's most important thing, the likely obstacle and what I'll do if it comes up ("if X happens, I'll do Y"). The path, not just the goal reached. - Move: a few minutes of movement at home, or the gym. - Read: a few pages of something that helps me grow. - Write: give thanks for something specific and jot down an idea from what I read. - It's a method of its own, with these names. Even if it looks like others you know, don't call it by another name or use their acronyms. - Rest counts too: a rest day doesn't break my sunrises in a row. - Each weekday is Normal, Gym or Rest. Saturday is Shabbat and doesn't change. - Normal and Gym each have their own schedule of blocks with a time (for example Get up, Sunrise, Shower, Asleep). Some blocks hold steps, in order. - Each step's time is its block's time plus the minutes of the steps before it. To move a step, its block moves or minutes change. - Only Breathe and Read have minutes that can be changed: from 1 to 60, or 75, 90, 105 or 120. The other steps' minutes come from their content (Affirm about 25 seconds per phrase, Imagine 1 minute per question, Write 2, Move 8 or however long the gym lasts). - The bedtime block is in "The night before": it's when I go to sleep the night before that day. "windDown" is how many minutes before bedtime the reminder to get ready arrives: from 15 to 90, in steps of 5, the same every night. - A time or some minutes can be different on one weekday ("hoursByDay", "minutesByDay") or on one date ("dates", from today up to a year ahead). - Blocks can't be added, removed or renamed, and steps can't move from one block to another. If that would suit me, tell me in the conversation, not in the change block.
es: ## Cómo funciona la app - Mi amanecer son seis pasos cortos cada mañana, para empezar el día conmigo antes que con el mundo. Son siempre los seis: si falta tiempo, se acortan, no se quitan. - Respira: unos minutos quieto, para respirar, meditar o rezar. - Afirma: en voz alta, pocas frases que me crea sobre quién elijo ser. Nada exagerado como "soy increíble": a quien no se lo cree lo hace sentir peor. - Imagina: lo más importante de hoy, el obstáculo probable y qué haré si pasa ("si pasa X, hago Y"). El camino, no solo la meta cumplida. - Muévete: unos minutos de movimiento en casa, o el gym. - Lee: unas páginas de algo que me haga crecer. - Escribe: agradecer algo concreto y anotar una idea de lo que leí. - Es un método propio con estos nombres. Aunque se parezca a otros que conoces, no lo llames con otro nombre ni uses sus siglas. - Descansar también cuenta: un día de descanso no corta mis amaneceres seguidos. - Cada día de la semana es Normal, Gym o Descanso. El sábado es Shabbat y no se cambia. - Normal y Gym tienen su propio horario de bloques con hora (por ejemplo Te paras, Amanecer, Baño, Dormido). Algunos bloques tienen pasos dentro, en orden. - La hora de cada paso es la hora de su bloque más los minutos de los pasos que van antes. Para mover un paso, se mueve su bloque o se cambian minutos. - Solo Respira y Lee tienen minutos que se pueden cambiar: de 1 a 60, o 75, 90, 105 o 120. Los de los otros pasos salen de su contenido (Afirma unos 25 segundos por frase, Imagina 1 minuto por pregunta, Escribe 2, Muévete 8 o lo que dura el gym). - "Dormido" está en "La noche anterior": es la hora de dormir de la noche antes de ese día. "Prepararte" son los minutos antes de Dormido en que me llega el aviso para prepararme: de 15 a 90, de 5 en 5, el mismo todas las noches. - Una hora o unos minutos pueden ser distintos un día de la semana ("horasPorDia", "minutosPorDia") o una fecha ("fechas", desde hoy hasta un año adelante). - No se pueden agregar, quitar ni renombrar bloques, ni mover pasos de un bloque a otro. Si eso me convendría, dímelo en la conversación, no en el bloque de cambios.

source: ## How to work with me - Talk first: understand what I'm asking, ask me what you don't know and suggest ideas. I don't always want to change something; sometimes I want to think or discuss. - Respect my notes: what they say doesn't move, doesn't move. - Give me the change block only when I accept a proposal or ask you for the changes. Not before. - Before suggesting a time, check that the block's steps end before the next block.
es: ## Cómo trabajar conmigo - Primero conversa: entiende lo que te pido, pregúntame lo que no sepas y propón ideas. No siempre quiero cambiar algo; a veces quiero pensar o discutir. - Respeta mis notas: lo que dicen que no se mueve, no se mueve. - Dame el bloque de cambios solo cuando yo acepte una propuesta o te pida los cambios. Antes no. - Antes de proponer una hora, revisa que los pasos del bloque terminen antes del bloque siguiente.

source: ## My configuration (this is what can be changed)
es: ## Mi configuración (esto es lo que se puede cambiar)

source: ## My notes (what the app doesn't know)
es: ## Mis notas (lo que la app no sabe)

source: ## The change block When I ask you to, at the end of your reply put a code block marked `sunling` with a JSON that has **only what changes**, in the same shape as my configuration. Whatever you leave out stays the same. - Morning times are written "5:20"; afternoon and evening ones with pm: "8:50 pm". - To bring a weekday's or a date's time or minutes back to the usual, set them to null. To remove all of a date's changes: "YYYY-MM-DD": null. - The affirmations and the Imagine questions go complete and in their final order, even if only one changes. - Use the block names exactly as they are in my configuration. Example of the shape (not a proposal): ```sunling { "normal": {"hours": {"%@": "5:45"}, "minutes": {"read": 15}}, "week": {"thursday": "gym"}, "dates": {"YYYY-MM-DD": {"type": "rest"}} } ``` I copy your reply and paste it into the app, which shows me each change before applying it.
es: ## El bloque de cambios Cuando yo te lo pida, al final de tu respuesta pon un bloque de código marcado `sunling` con un JSON que tenga **solo lo que cambia**, con la misma forma que mi configuración. Lo que no pongas se queda igual. - Las horas de la mañana se escriben "5:20"; las de la tarde y la noche, con pm: "8:50 pm". - Para que la hora o los minutos de un día de la semana o de una fecha vuelvan a ser como siempre, ponles null. Para quitar todos los cambios de una fecha: "AAAA-MM-DD": null. - Las afirmaciones y las preguntas de visualización van completas y en su orden final, aunque cambie una sola. - Usa los nombres de los bloques tal como están en mi configuración. Ejemplo de la forma (no es una propuesta): ```sunling { "normal": {"horas": {"%@": "5:45"}, "minutos": {"lee": 15}}, "semana": {"jueves": "gym"}, "fechas": {"AAAA-MM-DD": {"tipo": "descanso"}} } ``` Yo copio tu respuesta y la pego en la app, que me muestra cada cambio antes de aplicarlo.

source: ## What I want
es: ## Lo que quiero

source: ## What each day looks like (worked out by the app, read only)
es: ## Así es cada día (lo calcula la app, solo para leer)

source: %@ (round %lld)
es: %1$@ (ronda %2$lld)

source: %@ at %@
es: %1$@ a las %2$@

source: %@ can't be changed from the app.
es: %@ no se puede cambiar desde la app.

source: %@ ends at %@, past %@ at %@
es: %1$@ termina %2$@, pasa las %4$@ de %3$@

source: %@ has passed: only dates from today on can be changed.
es: %@ ya pasó: solo se cambian fechas desde hoy.

source: %@ has to have "%@" and "%@".
es: %1$@ tiene que tener "%2$@" y "%3$@".

source: %@ have another time. If you change it here, they all end up the same.
es: %@ tienen otra hora. Si la cambias aquí, todos quedan iguales.

source: %@ have other minutes. If you change them here, they all end up the same.
es: %@ tienen otros minutos. Si los cambias aquí, todos quedan iguales.

source: %@ is %@: it has no sunrise hours or minutes.
es: %1$@ es %2$@: no tiene horas ni minutos del amanecer.

source: %@ is a Saturday (Shabbat) and doesn't change.
es: %@ es sábado (Shabbat) y no se cambia.

source: %@ is being prepared: %lld of %lld phrases. Meanwhile, %@ plays.
es: %1$@ se está preparando: %2$lld de %3$lld frases. Mientras, suena %4$@.

source: %@ is more than a year away: only dates up to a year ahead can be changed.
es: %@ está a más de un año: solo se cambian fechas hasta un año adelante.

source: %@ isn't a date (it's written YYYY-MM-DD).
es: %@ no es una fecha (se escribe AAAA-MM-DD).

source: %@ isn't a day that can be changed (%@ in %@).
es: %1$@ no es un día que se pueda cambiar (%2$@ en %3$@).

source: %@ isn't a kind of day (%@): use normal, gym or rest.
es: %1$@ no es un tipo de día (%2$@): usa normal, gym o descanso.

source: %@ isn't a step (%@).
es: %1$@ no es un paso (%2$@).

source: %@ isn't a time (%@ in %@).
es: %1$@ no es una hora (%2$@ en %3$@).

source: %@ isn't a time (%@, %@).
es: %1$@ no es una hora (%2$@, %3$@).

source: %@ isn't a way to read: use books, kindle or paper.
es: %@ no es una forma de leer: usa libros, kindle o papel.

source: %@ isn't a weekday.
es: %@ no es un día de la semana.

source: %@ left.
es: Faltan %@.

source: %@ left. It checks itself off when you're back.
es: Faltan %@. Se marca sola al volver.

source: %@ on %@
es: %1$@ del %2$@

source: %@ only.
es: Solo %@.

source: %@ opens and I'll let you know when it's over.
es: Se abre %@ y te aviso al terminar.

source: %@ · %@ only
es: %1$@ · solo %2$@

source: %@ · %lld at the gym
es: %1$@ · %2$lld de gym

source: %@ → as usual (%@)
es: %1$@ → como siempre (%2$@)

source: %@ → like the other days (%@)
es: %1$@ → como los demás días (%2$@)

source: %@'s minutes come from its content and can't be changed.
es: Los minutos de %@ salen de su contenido y no se pueden cambiar.

source: %@, %@. Change this day
es: %1$@, %2$@. Cambiar este día

source: %@, %lld of 6
es: %1$@, %2$lld de 6

source: %@, changed
es: %@, cambiado

source: %@. Change this day
es: %@. Cambiar este día

source: %@: "%@" goes like {"%@": "7:00"}.
es: %1$@: "%2$@" va como {"%3$@": "7:00"}.

source: %@: "%@" goes like {"%@": 20}.
es: %1$@: "%2$@" va como {"%3$@": 20}.

source: %@: %@ minutes isn't possible (%@). Use 1 to 60, or 75, 90, 105 or 120.
es: %1$@: %2$@ minutos no se puede (%3$@). Usa de 1 a 60, o 75, 90, 105 o 120.

source: %@: it goes like {"%@": …, "%@": …, "%@": …}.
es: %1$@: va como {"%2$@": …, "%3$@": …, "%4$@": …}.

source: %lld changes applied
es: %lld cambios aplicados

source: %lld days ago
es: hace %lld días

source: %lld h ago
es: hace %lld h

source: %lld min %lld s
es: %1$lld min %2$lld s

source: %lld min ago
es: hace %lld min

source: %lld min before
es: %lld min antes

source: %lld minutes
es: %lld minutos

source: %lld minutes before bedtime, Sunday to Thursday. You change it in Schedule.
es: %lld minutos antes de Dormido, de domingo a jueves. Lo cambias en Horario.

source: %lld minutes with your coffee. The goal is the time, not the pages.
es: %lld minutos con tu café. La meta es el tiempo, no las páginas.

source: %lld of %lld mornings complete
es: %1$lld de %2$lld mañanas completas

source: %lld of %lld phrases ready. The rest play in the iPhone's voice.
es: %1$lld de %2$lld frases listas. Las que faltan suenan con la voz del iPhone.

source: %lld of 1 morning complete
es: %lld de 1 mañana completa

source: %lld phrases
es: %lld frases

source: %lld questions
es: %lld preguntas

source: %lld seconds
es: %lld segundos

source: %lld sunrises
es: %lld amaneceres

source: %lld sunrises in a row
es: %lld amaneceres seguidos

source: %lld → %lld min
es: %1$lld → %2$lld min

source: %lld → as usual (%lld min)
es: %1$lld → como siempre (%2$lld min)

source: %lld → like the other days (%lld min)
es: %1$lld → como los demás días (%2$lld min)

source: %lld. %@ (was %@)
es: %1$lld. %2$@ (antes %3$@)

source: %lld. New: %@
es: %1$lld. Nueva: %2$@

source: Account
es: Cuenta

source: Add affirmation
es: Agregar afirmación

source: Add affirmations
es: Agregar afirmaciones

source: Add question
es: Agregar pregunta

source: Add questions
es: Agregar preguntas

source: Affirm
es: Afirma

source: Affirm and Imagine, the first Sunday at 11:00 am.
es: Afirmaciones y visualización, el primer domingo a las 11:00 am.

source: Affirmations
es: Afirmaciones

source: Affirmations can't be left empty.
es: Afirmaciones no puede quedar vacía.

source: Affirmations have to be the whole list.
es: Afirmaciones tiene que ser la lista completa.

source: Affirmations reviewed
es: Afirmaciones revisadas

source: All
es: Todos

source: All %lld phrases are ready on this iPhone.
es: Las %lld frases están listas en este iPhone.

source: All day
es: Todo el día

source: All done
es: Hecho

source: All done. Move is checked off.
es: Listo. Ejercicio marcado.

source: Apply %lld changes
es: Aplicar %lld cambios

source: Asleep at %@.
es: Dormido a las %@.

source: Back
es: Vuelve

source: Back to the usual
es: Volver a lo de siempre

source: Backup
es: Copia de seguridad

source: Before bedtime, every night
es: Antes de Dormido, todas las noches

source: Before: %@
es: Antes: %@

source: Before: (empty)
es: Antes: (vacía)

source: Block %lld
es: Bloque %lld

source: Blocks can't be removed (%@ in %@).
es: No se pueden quitar bloques (%1$@ en %2$@).

source: Books
es: Libros

source: Breathe
es: Respira

source: Breathe in
es: Inhala

source: Breathe out
es: Exhala

source: Breathe slowly, let your back go
es: Respira lento, suelta la espalda

source: Breathing with your legs on the chair
es: Respiraciones con piernas en la silla

source: Bridge
es: Puente

source: Cancel
es: Cancelar

source: Chair squat
es: Sentadilla a silla

source: Changes from the AI
es: Cambios de la IA

source: Changes saved
es: Cambios guardados

source: Changes undone
es: Cambios deshechos

source: Check off %@
es: Marcar %@

source: Chest up, touch the chair and rise
es: Pecho arriba, toca la silla y sube

source: Close without changes
es: Cerrar sin cambios

source: Close your eyes and listen
es: Cierra los ojos y escucha

source: Closes the card
es: Cierra la carta

source: Closes the wheel
es: Cierra la rueda

source: Cloud
es: Nube

source: Connecting…
es: Conectando…

source: Copied
es: Copiado

source: Copy for the AI
es: Copiar para la IA

source: Couldn't connect to the cloud.
es: No se pudo conectar con la nube.

source: Couldn't save
es: No se pudo guardar

source: Couldn't sign in with Google. Tap again.
es: No se pudo entrar con Google. Toca otra vez.

source: Creating…
es: Creando…

source: Day complete
es: Día completo

source: Day off
es: Día libre

source: Days
es: Días

source: Days with a sunrise: %lld. Complete: %lld. By step: %@.
es: Días con amanecer: %1$lld. Completos: %2$lld. Por paso: %3$@.

source: Discard changes
es: Descartar cambios

source: Discard your changes?
es: ¿Descartar los cambios?

source: Do your affirmations and your Imagine questions still feel like yours?
es: ¿Tus afirmaciones y tu visualización siguen sintiéndose tuyas?

source: Done
es: Listo

source: Done, check off %@
es: Listo, marcar %@

source: Down
es: Baja

source: Edit
es: Editar

source: Empty
es: Vacío

source: End of reading
es: Fin de la lectura

source: Every week
es: Cada semana

source: Everything goes back to how it was before they were applied.
es: Todo vuelve a como estaba antes de aplicarlos.

source: Everything goes back to how it was before they were applied. What you changed afterwards is lost too.
es: Todo vuelve a como estaba antes de aplicarlos. También se pierde lo que cambiaste después.

source: Eyes closed, guided
es: Ojos cerrados, guiada

source: First paste your Gemini key
es: Primero pega tu clave de Gemini

source: Fix them and give me the whole change block again.
es: Corrígelos y dame otra vez el bloque de cambios completo.

source: For %@.
es: Para %@.

source: For a single day, like a holiday or a cancelled gym, tap it in Today or in History.
es: Para un solo día, como un feriado o un gym cancelado, tócalo en Hoy o en Historial.

source: From the book
es: Del libro

source: Gemini didn't answer (code %lld). Meanwhile, the iPhone's voice plays.
es: Gemini no respondió (código %lld). Mientras, suena la voz del iPhone.

source: Gemini didn't answer. Meanwhile, the iPhone's voice plays.
es: Gemini no respondió. Mientras, suena la voz del iPhone.

source: Gemini voice
es: Voz de Gemini

source: Get it free at aistudio.google.com with Get API key. It stays only on this iPhone: it never goes to the cloud. With no internet or no quota left, the iPhone's voice plays.
es: Sácala gratis en aistudio.google.com con Get API key. Se queda solo en este iPhone: no va a la nube. Sin internet o sin límite, suena la voz del iPhone.

source: Get ready
es: Prepárate

source: Give thanks and jot down
es: Agradecer y anotar

source: Glute bridge
es: Puente de glúteos

source: Goes back to the usual
es: Vuelve a ser como siempre

source: Good morning. This is your voice for Sunling.
es: Buenos días. Esta es tu voz para Sunling.

source: Google asks for a pause. Wait a minute and try again.
es: Google pide una pausa. Espera un minuto y vuelve a probar.

source: Grateful for
es: Agradezco

source: Gym day
es: Día de gym

source: Gym with your trainer
es: Gym con tu entrenador

source: Help
es: Ayuda

source: Hides what's done
es: Oculta lo hecho

source: History
es: Historial

source: Hold
es: Sostén

source: Home routine
es: Rutina en casa

source: Hours
es: Horas

source: How do I see myself doing today's most important thing well?
es: ¿Cómo me veo haciendo bien lo más importante de hoy?

source: How they look and whether they make a sound, you choose in Settings › Notifications › Sunling. With Sleep or another Focus they arrive silently and hidden, unless Sunling is one of its allowed apps.
es: Cómo se ven y si suenan lo eliges en Configuración › Notificaciones › Sunling. Con el modo Dormir u otra concentración llegan sin sonido y sin mostrarse, salvo que Sunling esté entre sus apps permitidas.

source: How you breathe, meditate or pray each morning: an app, a prayer, a place. Left empty, it says “%@”.
es: Cómo respiras, meditas o rezas cada mañana: una app, una oración, un lugar. Vacío, dice «%@».

source: I didn't find any changes for Sunling in what you copied
es: No encontré cambios para Sunling en lo que copiaste

source: I don't know yet. Ask me what I want to talk about.
es: Todavía no lo sé. Pregúntame de qué quiero hablar.

source: I'll let you know when it's over.
es: Te aviso al terminar.

source: I'm done
es: Ya terminé

source: If that happens, what will I do?
es: Si pasa eso, ¿qué hago?

source: If you like, you can do it again.
es: Si quieres, puedes repetirlo.

source: If you like, you can read again.
es: Si quieres, puedes leer otra vez.

source: Imagine
es: Imagina

source: Imagine done and checked off
es: Visualización lista y marcada

source: Imagine is done.
es: Visualización lista.

source: Imagine note
es: Nota de visualización

source: Imagine questions
es: Preguntas de visualización

source: Imagine questions can't be left empty.
es: Preguntas de visualización no puede quedar vacía.

source: Imagine questions have to be the whole list.
es: Preguntas de visualización tiene que ser la lista completa.

source: In %@, "%@" goes like {"%@": 15}.
es: En %1$@, "%2$@" va como {"%3$@": 15}.

source: In %@, "%@" goes like {"%@": {"%@": 10}}.
es: En %1$@, "%2$@" va como {"%3$@": {"%4$@": 10}}.

source: In %@, "%@" has to go by block and by day.
es: En %1$@, "%2$@" tiene que ir por bloque y por día.

source: In %@, "%@" has to have each block's time.
es: En %1$@, "%2$@" tiene que tener la hora de cada bloque.

source: In %@, %@ can't be changed.
es: En %1$@, %2$@ no se puede cambiar.

source: In %@, %@'s hours by day go like {"%@": "5:40"}.
es: En %1$@, las horas por día de %2$@ van como {"%3$@": "5:40"}.

source: In %@, %@'s minutes by day go like {"%@": 10}.
es: En %1$@, los minutos por día de %2$@ van como {"%3$@": 10}.

source: In Imagine questions, each one has to be a text.
es: En preguntas de visualización, cada una tiene que ser un texto.

source: In Imagine, %@ can't be changed.
es: En visualización, %@ no se puede cambiar.

source: In affirmations, each one has to be a text.
es: En afirmaciones, cada una tiene que ser un texto.

source: In the cloud
es: En la nube

source: It goes with instructions, your schedule, your affirmations, your Imagine questions, your notes and what you checked off in the last %lld weeks. Not what you write in %@.
es: Se manda con instrucciones, tu horario, tus afirmaciones, tu visualización, tus notas y lo que marcaste en las últimas %1$lld semanas. Lo que escribes en %2$@, no.

source: It saves by itself. If you change the same thing on the iPhone and on the Mac, the last change stays.
es: Se guarda solo. Si cambias lo mismo en el iPhone y en la Mac, se queda el último cambio.

source: Keep editing
es: Seguir editando

source: Keep my music
es: Mantener mi música

source: Key
es: Clave

source: Knees up, arms loose
es: Sube las rodillas, brazos sueltos

source: Last one: legs on the chair, breathe slowly.
es: Último: piernas en la silla, respira lento.

source: Later
es: Más tarde

source: Log my sunrise
es: Registrar mi amanecer

source: Lower back pressed to the floor
es: Espalda baja pegada al piso

source: Lower slowly
es: Baja despacio

source: Man · kind
es: Hombre · amable

source: Man · serene
es: Hombre · sereno

source: March
es: Marcha

source: March in place
es: Marchar en el sitio

source: March in place, one minute.
es: Marchar en el sitio, un minuto.

source: Meditate, pray or breathe
es: Medita, reza o solo respira

source: Minutes
es: Minutos

source: Minutes before bedtime
es: Minutos antes de Dormido

source: Minutes of %@
es: Minutos de %@

source: Minutes of %@, %lld
es: Minutos de %1$@, %2$lld

source: Minutes of %@, %lld, changed for this day
es: Minutos de %1$@, %2$lld, cambiados para este día

source: Monthly review
es: Revisión del mes

source: Monthly review done
es: Revisión del mes lista

source: Morning
es: Mañana

source: Morning done
es: Mañana lista

source: Move
es: Muévete

source: Move done and checked off
es: Ejercicio terminado y marcado

source: My day
es: Mi día

source: My obstacle
es: Mi obstáculo

source: My plan
es: Mi plan

source: My sunrise in Sunling
es: Mi amanecer en Sunling

source: My work, what never moves, what I want to achieve
es: Mi trabajo, lo que no se mueve, lo que quiero lograr

source: New month: do they still feel like yours?
es: Mes nuevo: ¿siguen sintiéndose tuyas?

source: Next
es: Siguiente

source: Next month
es: Mes siguiente

source: Next up: %@.
es: Sigue: %@.

source: Next: %@
es: Sigue %@

source: No connection. Try when you have internet.
es: Sin conexión. Prueba cuando tengas internet.
